{"_path":"/about","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"About Prof. Shankar Subramaniam","description":"Shankar Subramaniam is a Distinguished Professor of Bioengineering, Bioinformatics and Systems Biology, Computer Science & Engineering, Cellular & Molecular Medicine and Nano Engineering. He was recently the Chair of the Bioengineering Department at the University of California at San Diego (2008-13).  He holds the inaugural Joan and Irwin Jacobs Endowed Chair in Bioengineering and Systems Biology. He was the Founding Director of the Bioinformatics Graduate Program at the University of California at San Diego.  He also has adjunct Professorships at the Salk Institute for Biological Studies and the San Diego Supercomputer Center. He is also a Professor at the Center for Cardiovascular Bioinformatics and Modeling at Johns Hopkins University and was a Guest Professor at the Center for Molecular Biology and Neuroscience at the University of Oslo in Norway. Prior to moving to UC San Diego, Dr. Subramaniam was a Professor of Biophysics, Biochemistry, Molecular and Integrative Physiology, Chemical Engineering and Electrical and Computer Engineering at the University of Illinois at Urbana-Champaign (UIUC).  He was the Director of the Bioinformatics and Computational Biology Program at the National Center for Supercomputing Applications and the Co-Director of the W.M. Keck Center for Comparative and Functional Genomics at UIUC. He is a fellow of the American Institute for Medical and Biological Engineering (AIMBE) and is a recipient of Smithsonian Foundation and Association of Laboratory Automation Awards and his research work is described below. In 2013, he was elected as a Fellow of AAAS. In 2002, he received the Genome Technology All Star Award. In 2008, he was awarded the Faculty Excellence in Research Award at the University of California at San Diego. In 2011, he was appointed as a Distinguished Scientist at the San Diego Supercomputer Center. In 2014, he was appointed as a Distinguished Professor. His research spans several areas of bioinformatics and systems biology.","body":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"about-prof-shankar-subramaniam"},"children":[{"type":"text","value":"About Prof. Shankar Subramaniam"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Shankar Subramaniam is a Distinguished Professor of Bioengineering, Bioinformatics and Systems Biology, Computer Science & Engineering, Cellular & Molecular Medicine and Nano Engineering. He was recently the Chair of the "},{"type":"element","tag":"a","props":{"href":"http://be.ucsd.edu/","rel":["nofollow"]},"children":[{"type":"text","value":"Bioengineering Department"}]},{"type":"text","value":" at the University of California at San Diego (2008-13).  He holds the inaugural Joan and Irwin Jacobs Endowed Chair in Bioengineering and Systems Biology. He was the Founding Director of the "},{"type":"element","tag":"a","props":{"href":"http://bioinformatics.ucsd.edu/","rel":["nofollow"]},"children":[{"type":"text","value":"Bioinformatics Graduate Program"}]},{"type":"text","value":" at the University of California at San Diego.  He also has adjunct Professorships at the Salk Institute for Biological Studies and the San Diego Supercomputer Center. He is also a Professor at the Center for Cardiovascular Bioinformatics and Modeling at Johns Hopkins University and was a Guest Professor at the Center for Molecular Biology and Neuroscience at the University of Oslo in Norway. Prior to moving to UC San Diego, Dr. Subramaniam was a Professor of Biophysics, Biochemistry, Molecular and Integrative Physiology, Chemical Engineering and Electrical and Computer Engineering at the University of Illinois at Urbana-Champaign (UIUC).  He was the Director of the Bioinformatics and Computational Biology Program at the National Center for Supercomputing Applications and the Co-Director of the W.M. Keck Center for Comparative and Functional Genomics at UIUC. He is a fellow of the American Institute for Medical and Biological Engineering (AIMBE) and is a recipient of Smithsonian Foundation and Association of Laboratory Automation Awards and his research work is described below. In 2013, he was elected as a Fellow of AAAS. In 2002, he received the Genome Technology All Star Award. In 2008, he was awarded the Faculty Excellence in Research Award at the University of California at San Diego. In 2011, he was appointed as a Distinguished Scientist at the San Diego Supercomputer Center. In 2014, he was appointed as a Distinguished Professor. His research spans several areas of bioinformatics and systems biology."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Subramaniam has played a key role in raising national awareness for training and research in bioinformatics.  He served as a member of the National Institute for Health (NIH) Director’s Advisory Committee on Bioinformatics, which resulted in the BIOMEDICAL INFORMATION SCIENCE AND TECHNOLOGY INITIATIVE (BISTI) report.  The report recognized the dire need for trained professionals in Bioinformatics and recommended the launching of a strong NIH funding initiative.  Dr. Subramaniam served as the Chair of a NIH BISTI Study Section.  Dr. Subramaniam has also served on Bioinformatics and Biotechnology Advisory Councils for Virginia Tech, the University of Illinois at Chicago, and on the Scientific Advisory Board of several Biotech and Bioinformatics Companies.  Dr. Subramaniam has served as a member of the State of Illinois Governor’s initiative in Biotechnology and an advisor and reviewer of the State of North Carolina initiative in Biotechnology.  He is currently an overseas advisor for the Department of Biotechnology of the Government of India, and a member of a European Science Foundation Panel. In 2012, he was elected as the Chair of the College of Fellows of AIMBE. He serves on the External Advisory Boards for several Bio/Biomedical Engineering Departments including Johns Hopkins U., Case Western Reserve U., U. Penn, Georgia Tech, Rice U. and UT Austin."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"About Shankar\nAbout Research\nAbout Funding"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:about.md","_source":"content","_file":"about.md","_stem":"about","_extension":"md"}