{"generatedAt":1736474913394,"generateTime":266,"contents":[{"_path":"/about","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"About Prof. Shankar Subramaniam","description":"Shankar Subramaniam is a Distinguished Professor of Bioengineering, Bioinformatics and Systems Biology, Computer Science & Engineering, Cellular & Molecular Medicine and Nano Engineering. He was recently the Chair of the Bioengineering Department at the University of California at San Diego (2008-13). He holds the inaugural Joan and Irwin Jacobs Endowed Chair in Bioengineering and Systems Biology. He was the Founding Director of the Bioinformatics Graduate Program at the University of California at San Diego. He also has adjunct Professorships at the Salk Institute for Biological Studies and the San Diego Supercomputer Center. He is also a Professor at the Center for Cardiovascular Bioinformatics and Modeling at Johns Hopkins University and was a Guest Professor at the Center for Molecular Biology and Neuroscience at the University of Oslo in Norway. Prior to moving to UC San Diego, Dr. Subramaniam was a Professor of Biophysics, Biochemistry, Molecular and Integrative Physiology, Chemical Engineering and Electrical and Computer Engineering at the University of Illinois at Urbana-Champaign (UIUC). He was the Director of the Bioinformatics and Computational Biology Program at the National Center for Supercomputing Applications and the Co-Director of the W.M. Keck Center for Comparative and Functional Genomics at UIUC. He is a fellow of the American Institute for Medical and Biological Engineering (AIMBE) and is a recipient of Smithsonian Foundation and Association of Laboratory Automation Awards and his research work is described below. In 2013, he was elected as a Fellow of AAAS. In 2002, he received the Genome Technology All Star Award. In 2008, he was awarded the Faculty Excellence in Research Award at the University of California at San Diego. In 2011, he was appointed as a Distinguished Scientist at the San Diego Supercomputer Center. In 2014, he was appointed as a Distinguished Professor. His research spans several areas of bioinformatics and systems biology.","body":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"about-prof-shankar-subramaniam"},"children":[{"type":"text","value":"About Prof. Shankar Subramaniam"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Shankar Subramaniam is a Distinguished Professor of Bioengineering, Bioinformatics and Systems Biology, Computer Science & Engineering, Cellular & Molecular Medicine and Nano Engineering. He was recently the Chair of the "},{"type":"element","tag":"a","props":{"href":"http://be.ucsd.edu/","rel":["nofollow"]},"children":[{"type":"text","value":"Bioengineering Department"}]},{"type":"text","value":" at the University of California at San Diego (2008-13). He holds the inaugural Joan and Irwin Jacobs Endowed Chair in Bioengineering and Systems Biology. He was the Founding Director of the "},{"type":"element","tag":"a","props":{"href":"http://bioinformatics.ucsd.edu/","rel":["nofollow"]},"children":[{"type":"text","value":"Bioinformatics Graduate Program"}]},{"type":"text","value":" at the University of California at San Diego. He also has adjunct Professorships at the Salk Institute for Biological Studies and the San Diego Supercomputer Center. He is also a Professor at the Center for Cardiovascular Bioinformatics and Modeling at Johns Hopkins University and was a Guest Professor at the Center for Molecular Biology and Neuroscience at the University of Oslo in Norway. Prior to moving to UC San Diego, Dr. Subramaniam was a Professor of Biophysics, Biochemistry, Molecular and Integrative Physiology, Chemical Engineering and Electrical and Computer Engineering at the University of Illinois at Urbana-Champaign (UIUC). He was the Director of the Bioinformatics and Computational Biology Program at the National Center for Supercomputing Applications and the Co-Director of the W.M. Keck Center for Comparative and Functional Genomics at UIUC. He is a fellow of the American Institute for Medical and Biological Engineering (AIMBE) and is a recipient of Smithsonian Foundation and Association of Laboratory Automation Awards and his research work is described below. In 2013, he was elected as a Fellow of AAAS. In 2002, he received the Genome Technology All Star Award. In 2008, he was awarded the Faculty Excellence in Research Award at the University of California at San Diego. In 2011, he was appointed as a Distinguished Scientist at the San Diego Supercomputer Center. In 2014, he was appointed as a Distinguished Professor. His research spans several areas of bioinformatics and systems biology."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Subramaniam has played a key role in raising national awareness for training and research in bioinformatics. He served as a member of the National Institute for Health (NIH) Director’s Advisory Committee on Bioinformatics, which resulted in the BIOMEDICAL INFORMATION SCIENCE AND TECHNOLOGY INITIATIVE (BISTI) report. The report recognized the dire need for trained professionals in Bioinformatics and recommended the launching of a strong NIH funding initiative. Dr. Subramaniam served as the Chair of a NIH BISTI Study Section. Dr. Subramaniam has also served on Bioinformatics and Biotechnology Advisory Councils for Virginia Tech, the University of Illinois at Chicago, and on the Scientific Advisory Board of several Biotech and Bioinformatics Companies. Dr. Subramaniam has served as a member of the State of Illinois Governor’s initiative in Biotechnology and an advisor and reviewer of the State of North Carolina initiative in Biotechnology. He is currently an overseas advisor for the Department of Biotechnology of the Government of India, and a member of a European Science Foundation Panel. In 2012, he was elected as the Chair of the College of Fellows of AIMBE. He serves on the External Advisory Boards for several Bio/Biomedical Engineering Departments including Johns Hopkins U., Case Western Reserve U., U. Penn, Georgia Tech, Rice U. and UT Austin."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"About Shankar\nAbout Research\nAbout Funding"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:about.md","_source":"content","_file":"about.md","_stem":"about","_extension":"md"},{"_path":"/alumni","_dir":"","_draft":false,"_partial":false,"_locale":"","_id":"content:alumni.csv","_type":"csv","body":[{"name":"John Doe","age":"30","location":"California"},{"name":"Jane Smith","age":"25","location":"New York"}],"title":"Alumni","_source":"content","_file":"alumni.csv","_stem":"alumni","_extension":"csv"},{"_path":"/contact","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Contact","description":"","phone":"858-822-0986","email":"shankar-admin@ucsd.edu","address":"431, Powell-Focht Bioengineering Hall, UC San Diego, 9500 Gilman Drive, La Jolla, CA 92093","mapAPI":"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3350.6252599190207!2d-117.23694292355262!3d32.88163307362021!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x80dc06c312e92063%3A0x69155f3051f5a596!2sPowell-Focht%20Bioengineering%20Hall!5e0!3m2!1sen!2sus!4v1735779202016!5m2!1sen!2sus","body":{"type":"root","children":[],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:contact.md","_source":"content","_file":"contact.md","_stem":"contact","_extension":"md"},{"_path":"/funding","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Funding","description":"Funding Acknowledgements: NSF, NIH (NIGMS, NIDDK, NHLBI, NIAID), State of California and Corporate","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Funding Acknowledgements: NSF, NIH (NIGMS, NIDDK, NHLBI, NIAID), State of California and Corporate"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:funding.md","_source":"content","_file":"funding.md","_stem":"funding","_extension":"md"},{"_path":"/","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Home","description":"","body":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"home"},"children":[{"type":"text","value":"Home"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:index.md","_source":"content","_file":"index.md","_stem":"index","_extension":"md"},{"_path":"/members","_dir":"","_draft":false,"_partial":false,"_locale":"","_id":"content:members.csv","_type":"csv","body":[{"name":"John Doe","age":"30","location":"California"},{"name":"Jane Smith","age":"25","location":"New York"}],"title":"Members","_source":"content","_file":"members.csv","_stem":"members","_extension":"csv"},{"_path":"/publications","_dir":"","_draft":false,"_partial":false,"_locale":"","_id":"content:publications.csv","_type":"csv","body":[{"name":"John Doe","age":"30","location":"California"},{"name":"Jane Smith","age":"25","location":"New York"}],"title":"Publications","_source":"content","_file":"publications.csv","_stem":"publications","_extension":"csv"},{"_path":"/research/informatics-infrastructure","_dir":"research","_draft":false,"_partial":false,"_locale":"","title":"Informatics Infrastructure","description":"The importance of curated informatics resources: data and tools – the gateway to knowledge in biology\nOne of the major challenges in modern systems biology is the integration of diverse high and low throughput measurements on biological systems and deciphering biological mechanisms and pathways. My laboratory has been engaged in multi-omics multi-scale data integration for over a decade. For nearly a decade, we worked on integrating diverse data from measurements on macrophages and the progress in this area is reported across several publications. First, we used time series measurements of phosphoproteins in ligand treated macrophages along with time series cytokine readouts to understand the cellular signaling processes associated with macrophage cells.","slug":"informatics-infrastructure","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The importance of curated informatics resources: data and tools – the gateway to knowledge in biology\nOne of the major challenges in modern systems biology is the integration of diverse high and low throughput measurements on biological systems and deciphering biological mechanisms and pathways. My laboratory has been engaged in multi-omics multi-scale data integration for over a decade. For nearly a decade, we worked on integrating diverse data from measurements on macrophages and the progress in this area is reported across several publications. First, we used time series measurements of phosphoproteins in ligand treated macrophages along with time series cytokine readouts to understand the cellular signaling processes associated with macrophage cells."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Transcripts form one of several components, albeit an important one, in a cell. My laboratory had engaged for a few years already in characterizing a few other components, microRNA, lincRNA and phosphoproteins using existing methods. In addition, we participated in a large glue grant effort on lipidomics, which witnessed the development of the state of the art mass spectrometric methods for quantitative measurements of lipid analytes. I was the Director of the Bioinformatics and Systems Biology Cores of this grant and we had a ten-year investigation which led to arguably the best lipid resource in the world, “the Lipidomics Gateway” ("},{"type":"element","tag":"a","props":{"href":"http://www.lipidmaps.org","rel":["nofollow"]},"children":[{"type":"text","value":"http://www.lipidmaps.org"}]},{"type":"text","value":"). Our efforts in this project resulted in numerous peer-reviewed publications."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Prior to this latest review period we had built a large number of resources (used widely by the scientific community) including the Biology Workbench, the Signaling Gateway (originally, a collaboration with Nature), the Functional Genomics Workbench (based on novel algorithms for gene expression analysis, functional annotation and pathway building), and a number of boutique data resources. Our theme in building networks from data involves identifying pathway modules either dictated by comparative and evolutionary biology consideration or derived by applying various statistical learning strategies augmented by applying biological constraints. We have built numerous methodologies over the past 10 years towards this end. Recently, we have developed algorithms to use various graph theory methods to identify modules as well as reduce complex graphical networks into unique assembly of modules. Visualization and interactive analysis of pathways is a complex problem and we have now built and released a novel pathway editing tool that combines most recent computer science methods along with innovative biological tools."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I was recently awarded a $6 million grant from NIH Common Funds to establish the national metabolomics resource. My laboratory will coordinate activities of 6 other resource centers and numerous individual investigator awards. ("},{"type":"element","tag":"a","props":{"href":"http://www.metabolomicsworkbench.org","rel":["nofollow"]},"children":[{"type":"text","value":"http://www.metabolomicsworkbench.org"}]},{"type":"text","value":")"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:research:informatics-infrastructure.md","_source":"content","_file":"research/informatics-infrastructure.md","_stem":"research/informatics-infrastructure","_extension":"md"},{"_path":"/research/macrophage-systems-biology","_dir":"research","_draft":false,"_partial":false,"_locale":"","title":"Macrophage Systems Biology","description":"When I moved to UCSD, we began the Alliance for Cellular Signaling and our initial focus was B- and T-lymphocytes. Very soon, it became obvious that B-cells cannot be transfected easily and perturbation experiments were not an option. We shifted to studying a macrophage cell line, the RAW 264.7. This cell, which is a great model system for studying inflammation, became our mammalian systems biology learning playground for several years. We first used the phosphoproteomic and cytokine measurements using a multitude of ligands acting on the macrophages and developed a suite of novel computational methods. These methods led to very interesting biological insights. We mapped the common and distinct signaling pathways in macrophages, investigated the transcriptional response that were end points of the signaling cascade. Several papers resulted from this “learning experience” both in terms of methods development and mechanistic biology. Lipidmaps was initiated a few years after the Cell Signaling Project and the logical choice for the model system to study lipidomics was again the macrophage cell. Macrophages while being cytokine factories were also involved in physiological lipid changes especially in producing lipid mediators of pain and inflammation. The connection with atherosclerosis and insulin resistance was also an important factor in this choice. Given the mass spectrometric expertise in the consortium and the ever-improving transcriptomics methods, we were able to map completely the cellular lipidome in macrophage activation. We published the first mammalian lipidome paper and along with it came a host of statistical methodology that we developed to analyze integratively the transcriptome and the lipidome.","slug":"macrophage-systems-biology","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When I moved to UCSD, we began the Alliance for Cellular Signaling and our initial focus was B- and T-lymphocytes. Very soon, it became obvious that B-cells cannot be transfected easily and perturbation experiments were not an option. We shifted to studying a macrophage cell line, the RAW 264.7. This cell, which is a great model system for studying inflammation, became our mammalian systems biology learning playground for several years. We first used the phosphoproteomic and cytokine measurements using a multitude of ligands acting on the macrophages and developed a suite of novel computational methods. These methods led to very interesting biological insights. We mapped the common and distinct signaling pathways in macrophages, investigated the transcriptional response that were end points of the signaling cascade. Several papers resulted from this “learning experience” both in terms of methods development and mechanistic biology. Lipidmaps was initiated a few years after the Cell Signaling Project and the logical choice for the model system to study lipidomics was again the macrophage cell. Macrophages while being cytokine factories were also involved in physiological lipid changes especially in producing lipid mediators of pain and inflammation. The connection with atherosclerosis and insulin resistance was also an important factor in this choice. Given the mass spectrometric expertise in the consortium and the ever-improving transcriptomics methods, we were able to map completely the cellular lipidome in macrophage activation. We published the first mammalian lipidome paper and along with it came a host of statistical methodology that we developed to analyze integratively the transcriptome and the lipidome."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:research:macrophage-systems-biology.md","_source":"content","_file":"research/macrophage-systems-biology.md","_stem":"research/macrophage-systems-biology","_extension":"md"},{"_path":"/research/quantitative-transcriptomics","_dir":"research","_draft":false,"_partial":false,"_locale":"","title":"Quantitative Transcriptomics","description":"Nextgen sequencing technology has had a phenomenal impact in biology arguably in as significant a manner as PCR and cloning. Enamored by the rapid advances in this technology, we began to apply it to an interesting problem, one of deciphering transcriptional networks involved in differentiation of embryonic stem cells into cardiomyocytes (funded by a NHLBI grant). Very quickly, we discovered from analyzing the data that the use of random primer methodology in sequencing by synthesis limits the coverage and uniqueness of the RNA reads and further, we simply need large amounts of RNA from the system to obtain transcripts across a reasonable dynamic range. This is a huge challenge, when one is isolating painstakingly only hundreds of cells during intermediate stages of a stem cell differentiating into a specified lineage. I came up with a simple idea of using designed primers that would cover most of the transcriptome. The idea is to find out how many transcriptome-wide pseudo-unique hexamer primer sequences flanked by unique sequence regions in each gene are needed for coverage in sequencing by synthesis of a large part of the transcriptome. This involved two steps, the first where using bioinformatics, we had to identify a small but unique set of primers for the transcriptome. A postdoctoral associate in my laboratory developed a suffix tree-based method and obtained 44 primers for the mouse transcriptome that would give over 90%+ coverage of the transcriptome. An exceptional graduate student in my laboratory then worked hard for 2 years (!) to come up with the proper protocol for the experiments and we have proof of concept of this exciting technology (DP-seq) that has the potential to change the landscape of gene expression measurements. Our first paper describing this technology and an application to the transcriptome of germ layers in stem cell differentiation was published recently. We have also filed a disclosure to the UCSD Technology Transfer Office and a patent application is pending. One of the highlights of our technology was the ability to obtain transcripts across a large dynamic range with very low input of RNA (tens of picograms). We compared our method against the recent developments in low-input sequencing, namely Smart-seq and Cel-seq, and have demonstrated the power and limits of DP-seq in comparison with other methods. Most importantly, we delineated the stochastic noise arising in technical variations in all the amplification protocols starting with low amounts of RNA.","slug":"quantitative-transcriptomics","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Nextgen sequencing technology has had a phenomenal impact in biology arguably in as significant a manner as PCR and cloning. Enamored by the rapid advances in this technology, we began to apply it to an interesting problem, one of deciphering transcriptional networks involved in differentiation of embryonic stem cells into cardiomyocytes (funded by a NHLBI grant). Very quickly, we discovered from analyzing the data that the use of random primer methodology in sequencing by synthesis limits the coverage and uniqueness of the RNA reads and further, we simply need large amounts of RNA from the system to obtain transcripts across a reasonable dynamic range. This is a huge challenge, when one is isolating painstakingly only hundreds of cells during intermediate stages of a stem cell differentiating into a specified lineage. I came up with a simple idea of using designed primers that would cover most of the transcriptome. The idea is to find out how many transcriptome-wide pseudo-unique hexamer primer sequences flanked by unique sequence regions in each gene are needed for coverage in sequencing by synthesis of a large part of the transcriptome. This involved two steps, the first where using bioinformatics, we had to identify a small but unique set of primers for the transcriptome. A postdoctoral associate in my laboratory developed a suffix tree-based method and obtained 44 primers for the mouse transcriptome that would give over 90%+ coverage of the transcriptome. An exceptional graduate student in my laboratory then worked hard for 2 years (!) to come up with the proper protocol for the experiments and we have proof of concept of this exciting technology (DP-seq) that has the potential to change the landscape of gene expression measurements. Our first paper describing this technology and an application to the transcriptome of germ layers in stem cell differentiation was published recently. We have also filed a disclosure to the UCSD Technology Transfer Office and a patent application is pending. One of the highlights of our technology was the ability to obtain transcripts across a large dynamic range with very low input of RNA (tens of picograms). We compared our method against the recent developments in low-input sequencing, namely Smart-seq and Cel-seq, and have demonstrated the power and limits of DP-seq in comparison with other methods. Most importantly, we delineated the stochastic noise arising in technical variations in all the amplification protocols starting with low amounts of RNA."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We use nextgen sequencing extensively in a large number of project in my laboratory. Our objective is to a) analyze the data towards reconstructing networks and predicting phenotypes and b) integration with other –omics data to understand systemic behavior of cells and tissues."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:research:quantitative-transcriptomics.md","_source":"content","_file":"research/quantitative-transcriptomics.md","_stem":"research/quantitative-transcriptomics","_extension":"md"},{"_path":"/research/systems-computational-modeling","_dir":"research","_draft":false,"_partial":false,"_locale":"","title":"Systems Computational Modeling","description":"As a bioengineer, I believe that building quantitative models of systems is one of the most important components of systems biology. Unlike developing mathematical models of macroscopic systems like some organs and tissues, building models of systems from molecular components is a very hard task. Challenges in building biochemical models include (1) the complexity of proteomic states and interactions, (2) integration of diverse data to infer biochemical interactions, and (3) temporal state of biochemical models. Challenges in building mathematical models include (1) incorporating statistical/probabilistic information into analytical models, (2) utilizing qualitative constraints into mathematical models, and (3) incomplete knowledge and coarse-graining. Challenges in computational modeling are: (1) the absence of knowledge about model parameters such as rate constants, (2) local versus global concentrations of species and multiple length and time-scales, and (3) variation among different cell-types and sub-populational variability or variability among biological repeats. We have developed strategies addressing each of these challenges. In dealing with the problem of parameter estimation and optimization for biochemical network modeling, we have developed new methods involving multi-parametric sensitivity analysis and optimization with particle-swarm genetic algorithms. In order to reduce the complexity of the networks, we have developed a method that uses mixed-integer nonlinear programming for reduced order models. In building temporal networks, we have built probabilistic methods that will allow construction of time-series networks. We are also actively involved in developing stochastic kinetic modeling strategies for dealing with concentrations involving small number of molecules varying spatially in cellular locations. For all these developments, excellent data-driven networks of the GPCR and Calcium Signaling Pathway served as our models. Our kinetic modeling of the GPCR network established the ternary complex involving the receptor, G-protein and the RGS protein. This was subsequently verified with FRET experiments. Our calcium modeling led to prediction of calcium response in macrophages where components were knocked down and subsequent experiments verified our results. We also showed that single cell measurements of calcium in macrophage cells (thousands) in the Meyer laboratory in Stanford collectively fell into one of four types of curves that were reflected collectively in the measurements of whole ensemble of cells. This clearly showed that while microscopically cells differ in their behavior (concentrations of components), the collective phenotype reflects the “states” of cells which are finite, at least in a coarse-grained description. We then asked the question, how can we investigate local concentration of components in cells especially if these are small numbers of molecules? We developed a novel hybrid method that uses classical kinetics for components with large concentrations and a stochastic method for cases where the concentrations are low. We then examined the calcium measurements in the light of small concentrations.","slug":"systems-computational-modeling","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As a bioengineer, I believe that building quantitative models of systems is one of the most important components of systems biology. Unlike developing mathematical models of macroscopic systems like some organs and tissues, building models of systems from molecular components is a very hard task. Challenges in building biochemical models include (1) the complexity of proteomic states and interactions, (2) integration of diverse data to infer biochemical interactions, and (3) temporal state of biochemical models. Challenges in building mathematical models include (1) incorporating statistical/probabilistic information into analytical models, (2) utilizing qualitative constraints into mathematical models, and (3) incomplete knowledge and coarse-graining. Challenges in computational modeling are: (1) the absence of knowledge about model parameters such as rate constants, (2) local versus global concentrations of species and multiple length and time-scales, and (3) variation among different cell-types and sub-populational variability or variability among biological repeats. We have developed strategies addressing each of these challenges. In dealing with the problem of parameter estimation and optimization for biochemical network modeling, we have developed new methods involving multi-parametric sensitivity analysis and optimization with particle-swarm genetic algorithms. In order to reduce the complexity of the networks, we have developed a method that uses mixed-integer nonlinear programming for reduced order models. In building temporal networks, we have built probabilistic methods that will allow construction of time-series networks. We are also actively involved in developing stochastic kinetic modeling strategies for dealing with concentrations involving small number of molecules varying spatially in cellular locations. For all these developments, excellent data-driven networks of the GPCR and Calcium Signaling Pathway served as our models. Our kinetic modeling of the GPCR network established the ternary complex involving the receptor, G-protein and the RGS protein. This was subsequently verified with FRET experiments. Our calcium modeling led to prediction of calcium response in macrophages where components were knocked down and subsequent experiments verified our results. We also showed that single cell measurements of calcium in macrophage cells (thousands) in the Meyer laboratory in Stanford collectively fell into one of four types of curves that were reflected collectively in the measurements of whole ensemble of cells. This clearly showed that while microscopically cells differ in their behavior (concentrations of components), the collective phenotype reflects the “states” of cells which are finite, at least in a coarse-grained description. We then asked the question, how can we investigate local concentration of components in cells especially if these are small numbers of molecules? We developed a novel hybrid method that uses classical kinetics for components with large concentrations and a stochastic method for cases where the concentrations are low. We then examined the calcium measurements in the light of small concentrations."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Much of the above falls under the category of “equation (physics)-driven” methods and appeared to be divorced from data-driven “omics” measurements and methods. Very early on, I realized that it is essential to find ways to integrate data-driven and physics-driven modeling to produce models at multi-scale and granularity. And most importantly while “physical modeling” is intrinsically dynamic in nature, the data-driven models warrant time series measurements. The great merit of time series measurements is that they have the potential to provide some notion of “causal mechanisms”. The macrophage once again served as an excellent system since we have systematic time series of measurements of all components be they transcripts, proteins or lipids. Our goal then became reconstruction of networks from data, first canonical and static and subsequently dynamic network topologies."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A few years ago, I joined forces with mathematicians and computer scientists and we developed a Center for the Science of Information (funded by a NSF Science and Technology Center Initiative) involving Purdue, Stanford, MIT, Princeton, UIUC and UCSD. My main focus in this project was the development of networks from data both static and dynamic, establish notions of causality and modularity. To facilitate research in my laboratory, I divided the network reconstruction methods into algebraic, Bayesian and information-theoretic. Our first work in this area analyzed existing methods such as PLS, PCR, LASSO and LMI (established methods) for introduction of noise and missing data – things commonplace in biology. We established the limits of applicability of these methods. We then combined these methods to produce a superior method called DP-LASSO. In parallel, we extended an information-theoretic method with a novel cut-off criterion to build macrophage networks. I was, however, keen on exploring if we can a) decipher causal mechanisms from network reconstruction from dynamic data and b) ask if network topologies themselves are dynamic. We developed methods using “Granger causality” arguments to accomplish both and these are early days in these developments."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In parallel, we began exploring developing new methods for identifying modularity in large networks. Starting with protein-protein interaction networks and subsequently correlation networks from transcriptional data, we developed several exciting strategies. First, we developed a novel stopping criteria for a well-established Newman-Girvan betweenness algorithm. We then developed a variational Bayes method followed by a simple but elegant Newton method. All of these are now published in peer-reviewed journals."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In recent work, we have developed exciting methods for inferring time-varying causal networks from time-series data. We have applied this to a mammalian cell cycle and predicted the phases of the cell cycle without a priori assumptions. This method promises to be extremely useful in building causal networks."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:research:systems-computational-modeling.md","_source":"content","_file":"research/systems-computational-modeling.md","_stem":"research/systems-computational-modeling","_extension":"md"},{"_path":"/research/systems-medicine/insulin-resistance","_dir":"systems-medicine","_draft":false,"_partial":false,"_locale":"","title":"Insulin Resistance","description":"SKELETAL MUSCLE & ADIPOSE TISSUES: Over the past few years, I have become exceptionally keen on working physiology and pathology at the species level on mammalian systems. We were fortunate to get human adipose and muscle tissue samples from normal and diabetic patients and their phenotypic characterization by our School of Medicine colleagues. With exhaustive transcriptional studies on these tissues, we have been able to map functional pathway alterations in patients resistant and sensitive to an important class of drugs, thiozolidenediones, used in the treatment of Type II diabetes. We have identified molecular and functional characteristics of insulin resistant subjects and distinctions between TZD treatment responder and nonresponder subjects. Insulin resistant subjects exhibited alterations in skeletal muscle (e.g., glycolytic flux and intramuscular adipocytes) and adipose tissue (e.g., mitochondrial metabolism and inflammation) that improved relative to TZD-induced insulin sensitization. Pre-TZD treatment expression of MLXIP in muscle and HLA-DRB1 in adipose tissue from insulin resistant subjects was linearly predictive of post-TZD insulin sensitization. We have uniquely characterized coordinated cellular and tissue functional pathways that are characteristic of insulin resistance, TZD-induced insulin sensitization, and potential TZD responsiveness. This work was published in the Proceedings of the National Academy of Sciences and we followed up with a model animal study. This approach to Systems Medicine is very promising and we have already begun to study mammalian development and other complex diseases","slug":"insulin-resistance","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"SKELETAL MUSCLE & ADIPOSE TISSUES: Over the past few years, I have become exceptionally keen on working physiology and pathology at the species level on mammalian systems. We were fortunate to get human adipose and muscle tissue samples from normal and diabetic patients and their phenotypic characterization by our School of Medicine colleagues. With exhaustive transcriptional studies on these tissues, we have been able to map functional pathway alterations in patients resistant and sensitive to an important class of drugs, thiozolidenediones, used in the treatment of Type II diabetes. We have identified molecular and functional characteristics of insulin resistant subjects and distinctions between TZD treatment responder and nonresponder subjects. Insulin resistant subjects exhibited alterations in skeletal muscle (e.g., glycolytic flux and intramuscular adipocytes) and adipose tissue (e.g., mitochondrial metabolism and inflammation) that improved relative to TZD-induced insulin sensitization. Pre-TZD treatment expression of MLXIP in muscle and HLA-DRB1 in adipose tissue from insulin resistant subjects was linearly predictive of post-TZD insulin sensitization. We have uniquely characterized coordinated cellular and tissue functional pathways that are characteristic of insulin resistance, TZD-induced insulin sensitization, and potential TZD responsiveness. This work was published in the Proceedings of the National Academy of Sciences and we followed up with a model animal study. This approach to Systems Medicine is very promising and we have already begun to study mammalian development and other complex diseases"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:research:systems-medicine:insulin-resistance.md","_source":"content","_file":"research/systems-medicine/insulin-resistance.md","_stem":"research/systems-medicine/insulin-resistance","_extension":"md"},{"_path":"/research/systems-medicine/liver-regeneration-pathologies","_dir":"systems-medicine","_draft":false,"_partial":false,"_locale":"","title":"Liver Regeneration Pathologies","description":"I had the good fortune to interact with John Lambris at the University of Pennsylvania, arguably the biggest expert on the Complement System and he was investigating the role of complement in the regeneration of the liver. We collaborated on this project and identified the complement-IL4 regulatory circuit as a key module that regulates liver regeneration. Subsequently, we have carried out extensive transcriptional and recently lipid measurements on longitudinal changes in the mouse liver during regeneration. This has given us deep insights and exciting mechanisms and further investigations are in progress. The regeneration problem also helped me learn about pathologies of the liver and it became clear that the mechanisms of progression of liver disease from NAFLD to NASH to hepatocarcinoma are not well-understood and that our arsenal of experimental and computational methods would be excellent for the study of this problem. I am engaged in two projects involving NASH. In the first large-scale collaborative project, we are investigating using transcriptomics and lipidomics liver from human patients characterized in the four distinct phases of liver disease (normal, NAFLD, NASH and hepatocarcinoma). In a companion project, in collaboration with Jorge Moscat a distinguished cancer biologist, we are investigating mouse models, wild-type and P62 knockout, liver pathologies with systematic and longitudinal “omics” measurements. We are looking forward to developing quantitative network models of progression of liver disease and identifying potential therapeutic agents. We have now entered into an exceptionally interesting collaboration with Dr. Sindhi in CHOP, where his laboratory has one of the largest collections of patient tissues from biliary atresia. We are now investigating the GWAS studies in combination with the RNA seq data from these patient tissue samples. Recently, we have been fortunate to have an excellent collaborator, the Director of our Liver Center, Rohit Loomba with whom we have profiled human liver samples to find markers of NAFLD.","slug":"liver-regeneration-pathologies","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I had the good fortune to interact with John Lambris at the University of Pennsylvania, arguably the biggest expert on the Complement System and he was investigating the role of complement in the regeneration of the liver. We collaborated on this project and identified the complement-IL4 regulatory circuit as a key module that regulates liver regeneration. Subsequently, we have carried out extensive transcriptional and recently lipid measurements on longitudinal changes in the mouse liver during regeneration. This has given us deep insights and exciting mechanisms and further investigations are in progress. The regeneration problem also helped me learn about pathologies of the liver and it became clear that the mechanisms of progression of liver disease from NAFLD to NASH to hepatocarcinoma are not well-understood and that our arsenal of experimental and computational methods would be excellent for the study of this problem. I am engaged in two projects involving NASH. In the first large-scale collaborative project, we are investigating using transcriptomics and lipidomics liver from human patients characterized in the four distinct phases of liver disease (normal, NAFLD, NASH and hepatocarcinoma). In a companion project, in collaboration with Jorge Moscat a distinguished cancer biologist, we are investigating mouse models, wild-type and P62 knockout, liver pathologies with systematic and longitudinal “omics” measurements. We are looking forward to developing quantitative network models of progression of liver disease and identifying potential therapeutic agents. We have now entered into an exceptionally interesting collaboration with Dr. Sindhi in CHOP, where his laboratory has one of the largest collections of patient tissues from biliary atresia. We are now investigating the GWAS studies in combination with the RNA seq data from these patient tissue samples. Recently, we have been fortunate to have an excellent collaborator, the Director of our Liver Center, Rohit Loomba with whom we have profiled human liver samples to find markers of NAFLD."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:research:systems-medicine:liver-regeneration-pathologies.md","_source":"content","_file":"research/systems-medicine/liver-regeneration-pathologies.md","_stem":"research/systems-medicine/liver-regeneration-pathologies","_extension":"md"},{"_path":"/research/systems-medicine/neuropathologies","_dir":"systems-medicine","_draft":false,"_partial":false,"_locale":"","title":"Neuropathologies","description":"In the past few years we have embarked on the very exciting area of diseases of the human brain. In collaboration with Professor Inder Verma at the Salk Institute, we reconstructed the pathways that lead to glioblastoma and identified a key regulator of the pathological process. We were able to demonstrate both in vitro and in vivo through perturbation experiments a key protein that regulates glioma formation. This paper was recently published in Oncogene.","slug":"neuropathologies","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In the past few years we have embarked on the very exciting area of diseases of the human brain. In collaboration with Professor Inder Verma at the Salk Institute, we reconstructed the pathways that lead to glioblastoma and identified a key regulator of the pathological process. We were able to demonstrate both in vitro and in vivo through perturbation experiments a key protein that regulates glioma formation. This paper was recently published in Oncogene."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"More recently, we have worked extensively on early onset Alzheimer’s disease and have come up with very interesting insights into the mechanisms of AD pathology. The results of our analysis are indeed surprising and may provide a unique insight into several pathologies. Stay tuned…"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:research:systems-medicine:neuropathologies.md","_source":"content","_file":"research/systems-medicine/neuropathologies.md","_stem":"research/systems-medicine/neuropathologies","_extension":"md"},{"_path":"/research/systems-medicine/stress-endothelial-physiology","_dir":"systems-medicine","_draft":false,"_partial":false,"_locale":"","title":"Stress Endothelial Physiology","description":"In 2006, I was invited by the National Heart Lung and Blood Institute to help formulate a strategy for Systems Biology in pathologies of heart, lung and blood and this resulted in a “NHLBI Systems Biology” PA/RFA and I was one of the early awardees of a R33 grant to study cardiomyocyte differentiation using systems approaches. This project led to the development of the RNA seq method (described earlier) as well as the identification of small molecules (in the laboratory of co-Investigator Mercola) and micro RNA (jointly in our efforts) that promoted cardiomyocyte differentiation. This project also led me to investigations in oxidative stress in endothelial cells, where we have very detailed mechanisms associated with endothelial response (unpublished work, as yet). The latter motivated collaborations with Professors Shu Chien and John Shyy in launching a physiologically relevant research project on a systems biology study of shear stress response by the endothelium. We obtained two grants from NHLBI (jointly with Chien and Shyy) under the aegis of NHLBI Systems Biology initiative. Our initial work resulted in identification of differential regulation of response to pulsatile and oscillatory stress on endothelial cells by early signaling events and subsequent microRNA-based regulation of transcripts. This work was published in a few manuscripts. We are now embarking on a systematic time series “omics” study of endothelial response to differential stress and anticipate this will provide us with deep insights for identifying and treating vascular pathologies.","slug":"stress-endothelial-physiology","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In 2006, I was invited by the National Heart Lung and Blood Institute to help formulate a strategy for Systems Biology in pathologies of heart, lung and blood and this resulted in a “NHLBI Systems Biology” PA/RFA and I was one of the early awardees of a R33 grant to study cardiomyocyte differentiation using systems approaches. This project led to the development of the RNA seq method (described earlier) as well as the identification of small molecules (in the laboratory of co-Investigator Mercola) and micro RNA (jointly in our efforts) that promoted cardiomyocyte differentiation. This project also led me to investigations in oxidative stress in endothelial cells, where we have very detailed mechanisms associated with endothelial response (unpublished work, as yet). The latter motivated collaborations with Professors Shu Chien and John Shyy in launching a physiologically relevant research project on a systems biology study of shear stress response by the endothelium. We obtained two grants from NHLBI (jointly with Chien and Shyy) under the aegis of NHLBI Systems Biology initiative. Our initial work resulted in identification of differential regulation of response to pulsatile and oscillatory stress on endothelial cells by early signaling events and subsequent microRNA-based regulation of transcripts. This work was published in a few manuscripts. We are now embarking on a systematic time series “omics” study of endothelial response to differential stress and anticipate this will provide us with deep insights for identifying and treating vascular pathologies."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:research:systems-medicine:stress-endothelial-physiology.md","_source":"content","_file":"research/systems-medicine/stress-endothelial-physiology.md","_stem":"research/systems-medicine/stress-endothelial-physiology","_extension":"md"},{"_path":"/research/systems-medicine/striated-muscle-physiology-pathology","_dir":"systems-medicine","_draft":false,"_partial":false,"_locale":"","title":"Striated Muscle Physiology Pathology","description":"SKELETAL MUSCLE MYOPATHIES: Our first study of the human skeletal muscle began with an insulin resistance project. Along with a postdoc in my laboratory and a sabbatical visitor, I developed the first complete functional network model of the human skeletal muscle. Using transcriptomic measurements from hundreds of human patients (including our own clinical studies) and detailed legacy knowledge of the skeletal muscle, we were able to obtain the “canonical” normal skeletal muscle map. We examined data from DMD and ALS patients and identified aberrant mechanisms in these patients. We then used our modularity methods (described above) to identify cross-talk mechanisms in DMD patients. In collaboration with Richard Lieber, a muscle physiologist and physician, we developed network models of cerebral palsy and some of these investigations are continuing. Also, in collaboration with Lieber, we have teased out longitudinal response in skeletal muscle to Botox treatments. An exciting paper that describes the short and long term response to botox treatment followed.","slug":"striated-muscle-physiology-pathology","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"SKELETAL MUSCLE MYOPATHIES: Our first study of the human skeletal muscle began with an insulin resistance project. Along with a postdoc in my laboratory and a sabbatical visitor, I developed the first complete functional network model of the human skeletal muscle. Using transcriptomic measurements from hundreds of human patients (including our own clinical studies) and detailed legacy knowledge of the skeletal muscle, we were able to obtain the “canonical” normal skeletal muscle map. We examined data from DMD and ALS patients and identified aberrant mechanisms in these patients. We then used our modularity methods (described above) to identify cross-talk mechanisms in DMD patients. In collaboration with Richard Lieber, a muscle physiologist and physician, we developed network models of cerebral palsy and some of these investigations are continuing. Also, in collaboration with Lieber, we have teased out longitudinal response in skeletal muscle to Botox treatments. An exciting paper that describes the short and long term response to botox treatment followed."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:research:systems-medicine:striated-muscle-physiology-pathology.md","_source":"content","_file":"research/systems-medicine/striated-muscle-physiology-pathology.md","_stem":"research/systems-medicine/striated-muscle-physiology-pathology","_extension":"md"},{"_path":"/research/systems-medicine/systems-vaccinology","_dir":"systems-medicine","_draft":false,"_partial":false,"_locale":"","title":"Systems Vaccinology","description":"I joined a large consortium studying “systems biology analysis of innate and adaptive responses to vaccination” headed by Emory University researchers. We now have patient response data (phenotype and transcriptional) after vaccination from responders and non-responders for years 2007-12. In a longitudinal study of the human transcriptome from influenza vaccinees across several years, we identified the phenotypic modules that characterize responders and non-responders. We were also able to identify mechanisms that lead to poor vaccination response of the elderly.","slug":"systems-vaccinology","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I joined a large consortium studying “systems biology analysis of innate and adaptive responses to vaccination” headed by Emory University researchers. We now have patient response data (phenotype and transcriptional) after vaccination from responders and non-responders for years 2007-12. In a longitudinal study of the human transcriptome from influenza vaccinees across several years, we identified the phenotypic modules that characterize responders and non-responders. We were also able to identify mechanisms that lead to poor vaccination response of the elderly."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:research:systems-medicine:systems-vaccinology.md","_source":"content","_file":"research/systems-medicine/systems-vaccinology.md","_stem":"research/systems-medicine/systems-vaccinology","_extension":"md"},{"_path":"/teaching","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"Teaching","description":"Teaching Home","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Teaching Home"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:teaching.md","_source":"content","_file":"teaching.md","_stem":"teaching","_extension":"md"}],"navigation":[{"title":"About Prof. Shankar Subramaniam","_path":"/about"},{"title":"Alumni","_path":"/alumni"},{"title":"Contact","_path":"/contact"},{"title":"Funding","_path":"/funding"},{"title":"Home","_path":"/"},{"title":"Members","_path":"/members"},{"title":"Publications","_path":"/publications"},{"title":"Research","_path":"/research","children":[{"title":"Informatics Infrastructure","_path":"/research/informatics-infrastructure"},{"title":"Macrophage Systems Biology","_path":"/research/macrophage-systems-biology"},{"title":"Quantitative Transcriptomics","_path":"/research/quantitative-transcriptomics"},{"title":"Systems Computational Modeling","_path":"/research/systems-computational-modeling"},{"title":"Systems Medicine","_path":"/research/systems-medicine","children":[{"title":"Insulin Resistance","_path":"/research/systems-medicine/insulin-resistance"},{"title":"Liver Regeneration Pathologies","_path":"/research/systems-medicine/liver-regeneration-pathologies"},{"title":"Neuropathologies","_path":"/research/systems-medicine/neuropathologies"},{"title":"Stress Endothelial Physiology","_path":"/research/systems-medicine/stress-endothelial-physiology"},{"title":"Striated Muscle Physiology Pathology","_path":"/research/systems-medicine/striated-muscle-physiology-pathology"},{"title":"Systems Vaccinology","_path":"/research/systems-medicine/systems-vaccinology"}]}]},{"title":"Teaching","_path":"/teaching"}]}